#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_api_gateway_deployment.kalkulacka (deposed object c5e8670a): Refreshing state... [id=8x1jr7]
aws_iam_role.kalkulacka: Refreshing state... [id=kalkulacka]
aws_api_gateway_deployment.kalkulacka (deposed object a2668635): Refreshing state... [id=e9zbbk]
aws_api_gateway_deployment.kalkulacka (deposed object 0b36f7c6): Refreshing state... [id=228iip]
aws_s3_bucket.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_api_gateway_deployment.kalkulacka (deposed object 99c49f1e): Refreshing state... [id=nymsbk]
aws_api_gateway_deployment.kalkulacka (deposed object 43472e3e): Refreshing state... [id=r7drdq]
aws_api_gateway_deployment.kalkulacka (deposed object 81d470ab): Refreshing state... [id=s2oy1k]
module.newrelic_log_ingestion.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/newrelic-log-ingestion]
aws_s3_bucket.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_api_gateway_deployment.kalkulacka (deposed object 65bbb9c8): Refreshing state... [id=onm7h9]
aws_cloudfront_origin_access_identity.default: Refreshing state... [id=E3MZV8ZRF1OECX]
aws_ecr_repository.lambda-utils: Refreshing state... [id=lambda-utils]
aws_dynamodb_table.dynamodb_table_results: Refreshing state... [id=Results]
aws_ecr_repository.backend: Refreshing state... [id=backend]
module.newrelic_log_ingestion.aws_iam_role.lambda_role[0]: Refreshing state... [id=newrelic-log-ingestion]
module.newrelic_log_ingestion.null_resource.build_lambda[0]: Refreshing state... [id=4744747442388673836]
aws_iam_role_policy.kalkulacka-cloudwatch: Refreshing state... [id=kalkulacka:kalkulacka-cloudwatch]
aws_lambda_function.lambda-inject-meta: Refreshing state... [id=lambda-inject-meta]
aws_ecr_lifecycle_policy.lambda-utils-expire-old: Refreshing state... [id=lambda-utils]
aws_lambda_function.lambda-gen-ogimage: Refreshing state... [id=lambda-gen-ogimage]
module.newrelic_log_ingestion.aws_iam_role_policy_attachment.lambda_log_policy[0]: Refreshing state... [id=newrelic-log-ingestion-20220808151355927100000001]
module.newrelic_log_ingestion.aws_lambda_function.ingestion_function: Refreshing state... [id=newrelic-log-ingestion]
aws_ecr_lifecycle_policy.backend-expire-old: Refreshing state... [id=backend]
aws_lambda_function.kalkulacka: Refreshing state... [id=Kalkulacka]
aws_iam_role_policy.kalkulacka-dynamodb: Refreshing state... [id=kalkulacka:kalkulacka-dynamodb]
aws_api_gateway_rest_api.kalkulacka: Refreshing state... [id=qxkgzy4u31]
module.newrelic_log_ingestion.aws_lambda_permission.log_invoke_permission: Refreshing state... [id=terraform-20220907095847835800000001]
aws_s3_bucket_policy.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_lambda_permission.api-gateway-invoke-lambda-gen-ogimage: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket_acl.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2,private]
aws_api_gateway_deployment.kalkulacka: Refreshing state... [id=fjqjp4]
aws_lambda_permission.api-gateway-invoke-lambda-inject-meta: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.api-gateway-invoke-lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_s3_bucket_policy.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_s3_bucket_acl.data: Refreshing state... [id=cesko-digital-kalkulacka-data,private]
aws_api_gateway_stage.kalkulacka: Refreshing state... [id=ags-qxkgzy4u31-default]
aws_cloudfront_distribution.distribution: Refreshing state... [id=EQ9HHUGA34PWX]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_table.dynamodb_table_results has changed
  ~ resource "aws_dynamodb_table" "dynamodb_table_results" {
        id             = "Results"
        name           = "Results"
        tags           = {}
        # (7 unchanged attributes hidden)




      ~ ttl {
          - attribute_name = "TimeToExist" -> null
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.kalkulacka must be replaced
+/- resource "aws_api_gateway_deployment" "kalkulacka" {
      ~ created_date  = "2022-09-07T18:59:06Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> (known after apply)
      ~ id            = "fjqjp4" -> (known after apply)
      ~ invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "111f05fb33b3e50ff5ae3654582e52abd337e43f" -> "05223e644187ee0aed6b5833a10f97a42e778caa"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object 0b36f7c6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-09-07T18:25:22Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "228iip" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "8b876b31c6b8637b206d0ba7b72fd6a95310e466"
        } -> null
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object 43472e3e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-09-07T17:50:08Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "r7drdq" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "04066c88f8d3d5fc2f2ae7f5c16483c4b9085dcb"
        } -> null
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object 65bbb9c8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-09-07T18:46:56Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "onm7h9" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "938dbc12b41e5f42d2f2392f2405fa8586fcdfaa"
        } -> null
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object 81d470ab) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-09-07T16:31:44Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "s2oy1k" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "1e822e64b96f4618cc04e37195280fb992ab648a"
        } -> null
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object 99c49f1e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-09-07T18:00:18Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "nymsbk" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "9a1add2e4c2387a8b4cd52413d8f41b55424dcc5"
        } -> null
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object a2668635) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-05-10T15:10:49Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "e9zbbk" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "05edcf95c4dac23f89294ff868b950c0a6d4104c"
        } -> null
    }

  # aws_api_gateway_deployment.kalkulacka (deposed object c5e8670a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "kalkulacka" {
      - created_date  = "2022-09-07T18:42:30Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-central-1:253211736382:qxkgzy4u31/" -> null
      - id            = "8x1jr7" -> null
      - invoke_url    = "https://qxkgzy4u31.execute-api.eu-central-1.amazonaws.com/" -> null
      - rest_api_id   = "qxkgzy4u31" -> null
      - triggers      = {
          - "redeployment" = "05223e644187ee0aed6b5833a10f97a42e778caa"
        } -> null
    }

  # aws_api_gateway_rest_api.kalkulacka will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "kalkulacka" {
      ~ body                         = jsonencode(
          ~ {
              ~ paths      = {
                  ~ "/image/{proxy+}" = {
                      ~ x-amazon-apigateway-any-method = {
                          ~ x-amazon-apigateway-integration = {
                              ~ responses           = {
                                  ~ default = {
                                      - responseTemplates = {
                                          - "image/png" = "Empty"
                                        } -> null
                                        # (1 unchanged element hidden)
                                    }
                                }
                                # (7 unchanged elements hidden)
                            }
                            # (1 unchanged element hidden)
                        }
                    }
                    # (3 unchanged elements hidden)
                }
                # (3 unchanged elements hidden)
            }
        )
        id                           = "qxkgzy4u31"
        name                         = "kalkulacka"
        tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.kalkulacka will be updated in-place
  ~ resource "aws_api_gateway_stage" "kalkulacka" {
      ~ deployment_id         = "fjqjp4" -> (known after apply)
        id                    = "ags-qxkgzy4u31-default"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudfront_distribution.distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "distribution" {
        id                             = "EQ9HHUGA34PWX"
        tags                           = {}
        # (19 unchanged attributes hidden)



      ~ ordered_cache_behavior {
          - cache_policy_id        = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad" -> null
          ~ default_ttl            = 0 -> 86400
          ~ max_ttl                = 0 -> 86400
          ~ path_pattern           = "/js/script.outbound-links.js" -> "/image/*"
          ~ target_origin_id       = "plausible.io" -> "backend"
            # (8 unchanged attributes hidden)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }
      ~ ordered_cache_behavior {
          ~ allowed_methods        = [
              - "DELETE",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
                # (2 unchanged elements hidden)
            ]
          - cache_policy_id        = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad" -> null
          ~ default_ttl            = 0 -> 86400
          ~ max_ttl                = 0 -> 86400
          ~ path_pattern           = "/api/event" -> "/test/*"
          ~ target_origin_id       = "plausible.io" -> "backend"
            # (7 unchanged attributes hidden)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }
      ~ ordered_cache_behavior {
          + cache_policy_id        = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          ~ path_pattern           = "/data*" -> "/js/script.outbound-links.js"
          ~ target_origin_id       = "S3-cesko-digital-kalkulacka-data" -> "plausible.io"
            # (10 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }
      ~ ordered_cache_behavior {
          + cache_policy_id        = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          ~ path_pattern           = "/api*" -> "/api/event"
          ~ target_origin_id       = "backend" -> "plausible.io"
            # (10 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }
      ~ ordered_cache_behavior {
          - cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6" -> null
          ~ default_ttl            = 0 -> 86400
          ~ max_ttl                = 0 -> 86400
          ~ path_pattern           = "/test/*" -> "/data*"
          ~ target_origin_id       = "backend" -> "S3-cesko-digital-kalkulacka-data"
            # (8 unchanged attributes hidden)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }
      ~ ordered_cache_behavior {
          ~ allowed_methods        = [
              + "DELETE",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
                # (2 unchanged elements hidden)
            ]
          - cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6" -> null
          ~ path_pattern           = "/image/*" -> "/api*"
            # (10 unchanged attributes hidden)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "plausible.io" -> null
          - origin_id           = "plausible.io" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "plausible.io"
          + origin_id           = "plausible.io"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "qxkgzy4u31.execute-api.eu-central-1.amazonaws.com" -> null
          - origin_id           = "backend" -> null
          - origin_path         = "/default" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "backend"
          + origin_path         = "/default"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "cesko-digital-kalkulacka-data.s3.eu-central-1.amazonaws.com" -> null
          - origin_id           = "S3-cesko-digital-kalkulacka-data" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E3MZV8ZRF1OECX" -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "cesko-digital-kalkulacka-data.s3.eu-central-1.amazonaws.com"
          + origin_id           = "S3-cesko-digital-kalkulacka-data"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E3MZV8ZRF1OECX"
            }
        }
      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "cesko-digital-kalkulacka-frontend-2.s3.eu-central-1.amazonaws.com" -> null
          - origin_id           = "S3-cesko-digital-kalkulacka-frontend-2" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E3MZV8ZRF1OECX" -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "cesko-digital-kalkulacka-frontend-2.s3.eu-central-1.amazonaws.com"
          + origin_id           = "S3-cesko-digital-kalkulacka-frontend-2"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E3MZV8ZRF1OECX"
            }
        }


        # (4 unchanged blocks hidden)
    }

  # aws_dynamodb_table.dynamodb_table_results will be updated in-place
  ~ resource "aws_dynamodb_table" "dynamodb_table_results" {
        id             = "Results"
        name           = "Results"
        tags           = {}
        # (7 unchanged attributes hidden)




      ~ ttl {
          + attribute_name = "TimeToExist"
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @martinwenisch, Action: `pull_request`*